projects/legion-test/app/models/post.rb

  def soft_delete
    transaction do
      update!(deleted_at: Time.current)
      comments.where(deleted_at: nil).update_all(deleted_at: Time.current, cascade_deleted: true)
---
UPDATE "posts" SET "updated_at" = '2026-03-06 16:39:39.196164', "deleted_at" = '2026-03-06 16:39:39.196079' WHERE "posts"."id" = 1
UPDATE "comments" SET "deleted_at" = '2026-03-06 16:43:07.211563', "cascade_deleted" = TRUE WHERE "comments"."deleted_at" IS NULL AND "comments"."commentable_id" = 1 AND "comments"."commentable_type" = 'Post' AND "comments"."deleted_at" IS NULL

  def restore
    transaction do
      update!(deleted_at: nil)
      comments.with_deleted.where(cascade_deleted: true).update_all(deleted_at: nil, cascade_deleted: false)
---
UPDATE "posts" SET "updated_at" = '2026-03-06 16:39:39.200000', "deleted_at" = NULL WHERE "posts"."id" = 1
UPDATE "comments" SET "deleted_at" = NULL, "cascade_deleted" = FALSE WHERE "comments"."deleted_at" IS NULL AND "comments"."commentable_id" = 1 AND "comments"."commentable_type" = 'Post' AND "comments"."cascade_deleted" = TRUE